harviswang/linux-3.10.99/arch/mips/m200/inc/hw_intc.h
//*****************************************************************************
//
// The following are defines for the bit fields in the INTC_O_PR1 register.
// 0: the corresponding interrupt is not active or is masked.
// 1: the corresponding interrupt is active or is not masked to the processor.
// Note: ETHC is only for FPGA
//
//*****************************************************************************
#define INTC_PR1_GPU            0x80000000  // GPU interrupt active/mask status
#define INTC_PR1_VPU            0x40000000  // VPU interrupt active/mask status
#define INTC_PR1_PDMAM          0x20000000  // PDMAM interrupt active/mask status
#define INTC_PR1_I2C0           0x10000000  // I2C0 interrupt active/mask status
#define INTC_PR1_I2C1           0x08000000  // I2C1 interrupt active/mask status
#define INTC_PR1_I2C2           0x04000000  // I2C2 interrupt active/mask status
#define INTC_PR1_I2C3           0x02000000  // I2C3 interrupt active/mask status
#define INTC_PR1_ETHC           0x00800000  // ETHC interrupt active/mask status
#define INTC_PR1_EFUSE          0x00400000  // EFUSE interrupt active/mask status
#define INTC_PR1_DDR            0x00100000  // DDR interrupt active/mask status
#define INTC_PR1_UART0          0x00080000  // UART0 interrupt active/mask status
#define INTC_PR1_UART1          0x00040000  // UART1 interrupt active/mask status
#define INTC_PR1_UART2          0x00020000  // UART2 interrupt active/mask status
#define INTC_PR1_UART3          0x00010000  // UART3 interrupt active/mask status
#define INTC_PR1_CPM            0x00008000  // CPM interrupt active/mask status
#define INTC_PR1_HARB0          0x00004000  // HARB0 interrupt active/mask status
#define INTC_PR1_HARB1          0x00002000  // HARB1 interrupt active/mask status
#define INTC_PR1_HARB2          0x00001000  // HARB2 interrupt active/mask status
#define INTC_PR1_PCM0           0x00000100  // PCM0 interrupt active/mask status
#define INTC_PR1_NFI            0x00000080  // NFI interrupt active/mask status
#define INTC_PR1_MSC0           0x00000020  // MSC0 interrupt active/mask status
#define INTC_PR1_MSC1           0x00000010  // MSC1 interrupt active/mask status
#define INTC_PR1_MSC2           0x00000008  // MSC1 interrupt active/mask status
#define INTC_PR1_UART4          0x00000004  // UART4 interrupt active/mask status
#define INTC_PR1_RTC            0x00000001  // RTC interrupt active/mask status

//*****************************************************************************
//
// The following are defines for the bit fields in the INTC_O_DSR0 register.
// 0: not pending, 1: pending
//
//*****************************************************************************
#define INTC_DSR0_LCD           0x80000000  // LCD DMA interrupt pending
#define INTC_DSR0_DELAY_LINE    0x40000000  // DELAY_LINE DMA interrupt pending
#define INTC_DSR0_ISP           0x20000000  // ISP DMA interrupt pending
#define INTC_DSR0_TCU0          0x08000000  // TCU0 DMA interrupt pending
#define INTC_DSR0_TCU1          0x04000000  // TCU1 DMA interrupt pending
#define INTC_DSR0_TCU2          0x02000000  // TCU2 DMA interrupt pending
#define INTC_DSR0_AES           0x00800000  // AES DMA interrupt pending
#define INTC_DSR0_HASH          0x00400000  // HASH DMA interrupt pending
#define INTC_DSR0_OTG           0x00200000  // OTG DMA interrupt pending
#define INTC_DSR0_EHCI          0x00100000  // EHCI DMA interrupt pending
#define INTC_DSR0_EPDC          0x00080000  // EPDC DMA interrupt pending
#define INTC_DSR0_SADC          0x00040000  // SADC DMA interrupt pending
#define INTC_DSR0_GPIO0         0x00020000  // GPIO0 DMA interrupt pending
#define INTC_DSR0_GPIO1         0x00010000  // GPIO1 DMA interrupt pending
#define INTC_DSR0_GPIO2         0x00008000  // GPIO2 DMA interrupt pending
#define INTC_DSR0_GPIO3         0x00004000  // GPIO3 DMA interrupt pending
#define INTC_DSR0_GPIO4         0x00002000  // GPIO4 DMA interrupt pending
#define INTC_DSR0_GPIO5         0x00001000  // GPIO5 DMA interrupt pending
#define INTC_DSR0_PDMA          0x00000400  // PDMA DMA interrupt pending
#define INTC_DSR0_SSI0          0x00000100  // SSI0 DMA interrupt pending
#define INTC_DSR0_SSI1          0x00000080  // SSI1 DMA interrupt pending
#define INTC_DSR0_IPU           0x00000040  // IPU DMA interrupt pending
#define INTC_DSR0_OHCI          0x00000020  // OHCI DMA interrupt pending
#define INTC_DSR0_CSI           0x00000010  // CSI DMA interrupt pending
#define INTC_DSR0_DSI           0x00000008  // DSI DMA interrupt pending
#define INTC_DSR0_BCH           0x00000004  // BCH DMA interrupt pending
#define INTC_DSR0_AIC0          0x00000002  // AIC0 DMA interrupt pending
#define INTC_DSR0_DMIC          0x00000001  // DMIC DMA interrupt pending

//*****************************************************************************
//
// The following are defines for the bit fields in the INTC_O_DMR0 register.
// 1: masked, 0: not masked
//
//*****************************************************************************
#define INTC_DMR0_LCD           0x80000000  // LCD DMA interrupt masked
#define INTC_DMR0_DELAY_LINE    0x40000000  // DELAY_LINE DMA interrupt masked
#define INTC_DMR0_ISP           0x20000000  // ISP DMA interrupt masked
#define INTC_DMR0_TCU0          0x08000000  // TCU0 DMA interrupt masked
#define INTC_DMR0_TCU1          0x04000000  // TCU1 DMA interrupt masked
#define INTC_DMR0_TCU2          0x02000000  // TCU2 DMA interrupt masked
#define INTC_DMR0_AES           0x00800000  // AES DMA interrupt masked
#define INTC_DMR0_HASH          0x00400000  // HASH DMA interrupt masked
#define INTC_DMR0_OTG           0x00200000  // OTG DMA interrupt masked
#define INTC_DMR0_EHCI          0x00100000  // EHCI DMA interrupt masked
#define INTC_DMR0_EPDC          0x00080000  // EPDC DMA interrupt masked
#define INTC_DMR0_SADC          0x00040000  // SADC DMA interrupt masked
#define INTC_DMR0_GPIO0         0x00020000  // GPIO0 DMA interrupt masked
#define INTC_DMR0_GPIO1         0x00010000  // GPIO1 DMA interrupt masked
#define INTC_DMR0_GPIO2         0x00008000  // GPIO2 DMA interrupt masked
#define INTC_DMR0_GPIO3         0x00004000  // GPIO3 DMA interrupt masked
#define INTC_DMR0_GPIO4         0x00002000  // GPIO4 DMA interrupt masked
#define INTC_DMR0_GPIO5         0x00001000  // GPIO5 DMA interrupt masked
#define INTC_DMR0_PDMA          0x00000400  // PDMA DMA interrupt masked
#define INTC_DMR0_SSI0          0x00000100  // SSI0 DMA interrupt masked
#define INTC_DMR0_SSI1          0x00000080  // SSI1 DMA interrupt masked
#define INTC_DMR0_IPU           0x00000040  // IPU DMA interrupt masked
#define INTC_DMR0_OHCI          0x00000020  // OHCI DMA interrupt masked
#define INTC_DMR0_CSI           0x00000010  // CSI DMA interrupt masked
#define INTC_DMR0_DSI           0x00000008  // DSI DMA interrupt masked
#define INTC_DMR0_BCH           0x00000004  // BCH DMA interrupt masked
#define INTC_DMR0_AIC0          0x00000002  // AIC0 DMA interrupt masked
#define INTC_DMR0_DMIC          0x00000001  // DMIC DMA interrupt masked

//*****************************************************************************
//
// The following are defines for the bit fields in the INTC_O_DPR0 register.
// 0: the corresponding interrupt is not active or is masked.
// 1: the corresponding interrupt is active or is not masked to the processor.
//
//*****************************************************************************
#define INTC_DPR0_LCD           0x80000000  // LCD DMA interrupt active/mask status
#define INTC_DPR0_DELAY_LINE    0x40000000  // DELAY_LINE DMA interrupt active/mask status
#define INTC_DPR0_ISP           0x20000000  // ISP DMA interrupt active/mask status
#define INTC_DPR0_TCU0          0x08000000  // TCU0 DMA interrupt active/mask status
#define INTC_DPR0_TCU1          0x04000000  // TCU1 DMA interrupt active/mask status
#define INTC_DPR0_TCU2          0x02000000  // TCU2 DMA interrupt active/mask status
#define INTC_DPR0_AES           0x00800000  // AES DMA interrupt active/mask status
#define INTC_DPR0_HASH          0x00400000  // HASH DMA interrupt active/mask status
#define INTC_DPR0_OTG           0x00200000  // OTG DMA interrupt active/mask status
#define INTC_DPR0_EHCI          0x00100000  // EHCI DMA interrupt active/mask status
#define INTC_DPR0_EPDC          0x00080000  // EPDC DMA interrupt active/mask status
#define INTC_DPR0_SADC          0x00040000  // SADC DMA interrupt active/mask status
#define INTC_DPR0_GPIO0         0x00020000  // GPIO0 DMA interrupt active/mask status
#define INTC_DPR0_GPIO1         0x00010000  // GPIO1 DMA interrupt active/mask status
#define INTC_DPR0_GPIO2         0x00008000  // GPIO2 DMA interrupt active/mask status
#define INTC_DPR0_GPIO3         0x00004000  // GPIO3 DMA interrupt active/mask status
#define INTC_DPR0_GPIO4         0x00002000  // GPIO4 DMA interrupt active/mask status
#define INTC_DPR0_GPIO5         0x00001000  // GPIO5 DMA interrupt active/mask status
#define INTC_DPR0_PDMA          0x00000400  // PDMA DMA interrupt active/mask status
#define INTC_DPR0_SSI0          0x00000100  // SSI0 DMA interrupt active/mask status
#define INTC_DPR0_SSI1          0x00000080  // SSI1 DMA interrupt active/mask status
#define INTC_DPR0_IPU           0x00000040  // IPU DMA interrupt active/mask status
#define INTC_DPR0_OHCI          0x00000020  // OHCI DMA interrupt active/mask status
#define INTC_DPR0_CSI           0x00000010  // CSI DMA interrupt active/mask status
#define INTC_DPR0_DSI           0x00000008  // DSI DMA interrupt active/mask status
#define INTC_DPR0_BCH           0x00000004  // BCH DMA interrupt active/mask status
#define INTC_DPR0_AIC0          0x00000002  // AIC0 DMA interrupt active/mask status
#define INTC_DPR0_DMIC          0x00000001  // DMIC DMA interrupt active/mask status

//*****************************************************************************
//
// The following are defines for the bit fields in the INTC_O_DSR1 register.
// 1: pending, 0: not pending
// Note: ETHC is only for FPGA
//
//*****************************************************************************
#define INTC_DSR1_GPU           0x80000000  // GPU DMA interrupt pending
#define INTC_DSR1_VPU           0x40000000  // VPU DMA interrupt pending
#define INTC_DSR1_PDMAM         0x20000000  // PDMAM DMA interrupt pending
#define INTC_DSR1_I2C0          0x10000000  // I2C0 DMA interrupt pending
#define INTC_DSR1_I2C1          0x08000000  // I2C1 DMA interrupt pending
#define INTC_DSR1_I2C2          0x04000000  // I2C2 DMA interrupt pending
#define INTC_DSR1_I2C3          0x02000000  // I2C3 DMA interrupt pending
#define INTC_DSR1_ETHC          0x00800000  // ETHC DMA interrupt pending
#define INTC_DSR1_EFUSE         0x00400000  // EFUSE DMA interrupt pending
#define INTC_DSR1_DDR           0x00100000  // DDR DMA interrupt pending
#define INTC_DSR1_UART0         0x00080000  // UART0 DMA interrupt pending
#define INTC_DSR1_UART1         0x00040000  // UART1 DMA interrupt pending
#define INTC_DSR1_UART2         0x00020000  // UART2 DMA interrupt pending
#define INTC_DSR1_UART3         0x00010000  // UART3 DMA interrupt pending
#define INTC_DSR1_CPM           0x00008000  // CPM DMA interrupt pending
#define INTC_DSR1_HARB0         0x00004000  // HARB0 DMA interrupt pending
#define INTC_DSR1_HARB1         0x00002000  // HARB1 DMA interrupt pending
#define INTC_DSR1_HARB2         0x00001000  // HARB2 DMA interrupt pending
#define INTC_DSR1_PCM0          0x00000100  // PCM0 DMA interrupt pending
#define INTC_DSR1_NFI           0x00000080  // NFI DMA interrupt pending
#define INTC_DSR1_MSC0          0x00000020  // MSC0 DMA interrupt pending
#define INTC_DSR1_MSC1          0x00000010  // MSC1 DMA interrupt pending
#define INTC_DSR1_MSC2          0x00000008  // MSC1 DMA interrupt pending
#define INTC_DSR1_UART4         0x00000004  // UART4 DMA interrupt pending
#define INTC_DSR1_RTC           0x00000001  // RTC DMA interrupt pending

//*****************************************************************************
//
// The following are defines for the bit fields in the INTC_O_DMR1 register.
// 1: masked, 0: not masked
// Note: ETHC is only for FPGA
//
//*****************************************************************************
#define INTC_DMR1_GPU           0x80000000  // GPU DMA interrupt masked
#define INTC_DMR1_VPU           0x40000000  // VPU DMA interrupt masked
#define INTC_DMR1_PDMAM         0x20000000  // PDMAM DMA interrupt masked
#define INTC_DMR1_I2C0          0x10000000  // I2C0 DMA interrupt masked
#define INTC_DMR1_I2C1          0x08000000  // I2C1 DMA interrupt masked
#define INTC_DMR1_I2C2          0x04000000  // I2C2 DMA interrupt masked
#define INTC_DMR1_I2C3          0x02000000  // I2C3 DMA interrupt masked
#define INTC_DMR1_ETHC          0x00800000  // ETHC DMA interrupt masked
#define INTC_DMR1_EFUSE         0x00400000  // EFUSE DMA interrupt masked
#define INTC_DMR1_DDR           0x00100000  // DDR DMA interrupt masked
#define INTC_DMR1_UART0         0x00080000  // UART0 DMA interrupt masked
#define INTC_DMR1_UART1         0x00040000  // UART1 DMA interrupt masked
#define INTC_DMR1_UART2         0x00020000  // UART2 DMA interrupt masked
#define INTC_DMR1_UART3         0x00010000  // UART3 DMA interrupt masked
#define INTC_DMR1_CPM           0x00008000  // CPM DMA interrupt masked
#define INTC_DMR1_HARB0         0x00004000  // HARB0 DMA interrupt masked
#define INTC_DMR1_HARB1         0x00002000  // HARB1 DMA interrupt masked
#define INTC_DMR1_HARB2         0x00001000  // HARB2 DMA interrupt masked
#define INTC_DMR1_PCM0          0x00000100  // PCM0 DMA interrupt masked
#define INTC_DMR1_NFI           0x00000080  // NFI DMA interrupt masked
#define INTC_DMR1_MSC0          0x00000020  // MSC0 DMA interrupt masked
#define INTC_DMR1_MSC1          0x00000010  // MSC1 DMA interrupt masked
#define INTC_DMR1_MSC2          0x00000008  // MSC1 DMA interrupt masked
#define INTC_DMR1_UART4         0x00000004  // UART4 DMA interrupt masked
#define INTC_DMR1_RTC           0x00000001  // RTC DMA interrupt masked

//*****************************************************************************
//
// The following are defines for the bit fields in the INTC_O_DPR1 register.
// 0: the corresponding interrupt is not active or is masked.
// 1: the corresponding interrupt is active or is not masked to the processor.
// Note: ETHC is only for FPGA
//
//*****************************************************************************
#define INTC_DMR1_GPU           0x80000000  // GPU DMA interrupt active/mask status
#define INTC_DPR1_VPU           0x40000000  // VPU DMA interrupt active/mask status
#define INTC_DPR1_PDMAM         0x20000000  // PDMAM DMA interrupt active/mask status
#define INTC_DPR1_I2C0          0x10000000  // I2C0 DMA interrupt active/mask status
#define INTC_DPR1_I2C1          0x08000000  // I2C1 DMA interrupt active/mask status
#define INTC_DPR1_I2C2          0x04000000  // I2C2 DMA interrupt active/mask status
#define INTC_DPR1_I2C3          0x02000000  // I2C3 DMA interrupt active/mask status
#define INTC_DPR1_ETHC          0x00800000  // ETHC DMA interrupt active/mask status
#define INTC_DPR1_EFUSE         0x00400000  // EFUSE DMA interrupt active/mask status
#define INTC_DPR1_DDR           0x00100000  // DDR DMA interrupt active/mask status
#define INTC_DPR1_UART0         0x00080000  // UART0 DMA interrupt active/mask status
#define INTC_DPR1_UART1         0x00040000  // UART1 DMA interrupt active/mask status
#define INTC_DPR1_UART2         0x00020000  // UART2 DMA interrupt active/mask status
#define INTC_DPR1_UART3         0x00010000  // UART3 DMA interrupt active/mask status
#define INTC_DPR1_CPM           0x00008000  // CPM DMA interrupt active/mask status
#define INTC_DPR1_HARB0         0x00004000  // HARB0 DMA interrupt active/mask status
#define INTC_DPR1_HARB1         0x00002000  // HARB1 DMA interrupt active/mask status
#define INTC_DPR1_HARB2         0x00001000  // HARB2 DMA interrupt active/mask status
#define INTC_DPR1_PCM0          0x00000100  // PCM0 DMA interrupt active/mask status
#define INTC_DPR1_NFI           0x00000080  // NFI DMA interrupt active/mask status
#define INTC_DPR1_MSC0          0x00000020  // MSC0 DMA interrupt active/mask status
#define INTC_DPR1_MSC1          0x00000010  // MSC1 DMA interrupt active/mask status
#define INTC_DPR1_MSC2          0x00000008  // MSC1 DMA interrupt active/mask status
#define INTC_DPR1_UART4         0x00000004  // UART4 DMA interrupt active/mask status
#define INTC_DPR1_RTC           0x00000001  // RTC DMA interrupt active/mask status

#endif /* __HW_INTC_H__ */

